/*已知一个整数n，打印1到n所有除以m后所得商正好是它的各个数字平方和的数。

输入格式:
为两个用空格分隔的整数，它们依次代表n、m（1<m,n<=10000)。

输出格式:
按从小到大的顺序依次输出所有满足条件的整数，每个数占一行。测试用例保证有满足条件的数。

输入样例:
1000 11

输出样例:
131
241
324
550
624
803
900
910
  */

#include <iostream>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    for (int i = 1; i <= n; i ++)
    {
        int u, d, c, k, t;
        t = i / 10000;
        k = (i - 10000 * t) / 1000;
        c = (i - 10000 * t - 1000 * k) / 100;
        d = (i - 10000 * t - 1000 * k - 100 * c) / 10;
        u = i - 10000 * t - 1000 * k - 100 * c - 10 * d; 
        if (i / m == (t * t + k * k + c * c + d * d + u * u)) cout << i << endl;
    }
    return 0;
}
